
//{[+](фрагмент добавлен), Admin 11.09.2018 13:54:15

&НаСервере
Процедура АНТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Документы.ПриходнаяНакладная.ПустаяСсылка() и НЕ ЗначениеЗаполнено(Параметры.Основание) Тогда
		 Объект.Организация = Справочники.Организации.ПустаяСсылка();
		 Объект.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		 Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка(); 
	КонецЕсли; 

КонецПроцедуры

//}Admin 11.09.2018 13:54:15