
//&Вместо("ОбработкаПроведения")
//Процедура АНТ_ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	ЭтоКомПоОтоплению = ЭтотОбъект.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию("Комерційне по опаленню", Истина);
//	ЭтоКомПоСолнечным = ЭтотОбъект.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию("Комерційне по сонячним", Истина);
//	ЭтоКомПоТепловым = ЭтотОбъект.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию("Комерційне по тепловим", Истина);
//	
//		
//	Если ЭтоКомПоОтоплению или ЭтоКомПоСолнечным или ЭтоКомПоТепловым Тогда
//		
//	
//	Иначе
//	// Инициализация дополнительных свойств для проведения документа
//	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
//	
//	// Инициализация данных документа
//	Документы.ЗаказПокупателя.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, ЭтотОбъект);
//	
//	// Подготовка наборов записей
//	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
//	
//	// Отражение в разделах учета
//	УправлениеНебольшойФирмойСервер.ОтразитьГрафикДвиженияЗапасов(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьПотребностьВЗапасах(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьРазмещениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыПоЗаказамПрогноз(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКРасходуСоСкладов(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПринятые(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьНачисленияИУдержания(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьНДСПродаж(ДополнительныеСвойства, Движения, Отказ);
//	
//	// СерийныеНомера
//	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
//	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераОстатки(ДополнительныеСвойства, Движения, Отказ);
//	
//	// ДисконтныеКарты
//	УправлениеНебольшойФирмойСервер.ОтразитьПродажиПоДисконтнойКарте(ДополнительныеСвойства, Движения, Отказ);
//	// АвтоматическиеСкидки
//	УправлениеНебольшойФирмойСервер.ОтразитьПредоставленныеАвтоматическиеСкидки(ДополнительныеСвойства, Движения, Отказ);
//	// Эквайринг
//	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетодЭквайринг(ДополнительныеСвойства, Движения, Отказ);
//	
//	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
//	
//	// Биллинг
//	УправлениеНебольшойФирмойСервер.ОтразитьВыполнениеДоговораОбслуживания(ДополнительныеСвойства, Движения, Отказ);
//	
//	// Запись наборов записей
//	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

//	// Контроль
//	Документы.ЗаказПокупателя.ВыполнитьКонтроль(ЭтотОбъект, ДополнительныеСвойства, Отказ);
//	
//	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();

//	КонецЕсли; 
//	
//		
////	ПродолжитьВызов(Отказ, РежимПроведения);
//КонецПроцедуры
