

//{[+](фрагмент добавлен), Admin 11.09.2018 13:55:07
&Перед("ОбработкаПроверкиЗаполнения")
Процедура АНТ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("Ответственный");
	ПроверяемыеРеквизиты.Добавить("Заказ");

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура АНТ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВалютаДокумента = ЭтотОбъект.ВалютаДокумента;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыЦен.Ссылка
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.ВалютаЦены = &ВалютаЦены
	|	И ВидыЦен.ИдентификаторФормул ПОДОБНО ""Закупочная%""";
	Запрос.УстановитьПараметр("ВалютаЦены", ВалютаДокумента);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выгрузить();
	Если Выборка.Количество() = 1 Тогда
		ВыбранныйВидЦены = Выборка[0].Ссылка;
		
		
		Для каждого Стр Из ЭтотОбъект.Запасы Цикл
			
			НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ВидЦен.Установить(ВыбранныйВидЦены);
			НаборЗаписей.Отбор.Период.Установить(ЭтотОбъект.Дата);
			НаборЗаписей.Отбор.Номенклатура.Установить(Стр.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(Стр.Характеристика);
			
			НовЗапись = НаборЗаписей.Добавить();
			
			НовЗапись.ВидЦен = ВыбранныйВидЦены;
			НовЗапись.Период  = ЭтотОбъект.Дата;
			НовЗапись.Номенклатура = Стр.Номенклатура;
			НовЗапись.Характеристика = Стр.Характеристика;
			НовЗапись.Цена  = Стр.Цена;
			НовЗапись.Актуальность = Истина;
			НовЗапись.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
			
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

//}Admin 11.09.2018 13:55:07

