
&НаКлиенте
Процедура ВыполнитьПереход1(Команда)
	ВыполнитьПереходНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьПереходНаСервере()
	
	//Перенос данных с реквизитов расширений в реквизиты конфигурации. Глюки при обновлениях.
	
	//РасходнаяНакладная
	//ТЧ.Запасы: УдалитьАНТ_ВидЦены, УдалитьАНТ_Коэффициент, УдалитьАНТ_ЦенаПоТипу 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗаписатьЗаказПокупателя = Ложь;
		
		Для каждого сТЧ Из ДокОбъект.Запасы Цикл
			Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_ВидЦены) Тогда
				сТЧ.А_ВидЦены = сТЧ.УдалитьАНТ_ВидЦены;
				ЗаписатьЗаказПокупателя = Истина;
			КонецЕсли;	
			Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_Коэффициент) Тогда
				сТЧ.А_Коэффициент = сТЧ.УдалитьАНТ_Коэффициент;
				ЗаписатьЗаказПокупателя = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_ЦенаПоТипу) Тогда
				сТЧ.А_ЦенаПоТипу = сТЧ.УдалитьАНТ_ЦенаПоТипу;
				ЗаписатьЗаказПокупателя = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗаписатьЗаказПокупателя = Истина Тогда
		Попытка
			ДокОбъект.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Записан документ " + ДокОбъект;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	КонецЦикла;
	
	//ЗаказПокупателя 
	//УдалитьАНТ_Тип, УдалитьАНТ_ПлощадьДома, УдалитьАНТ_Мощность, УдалитьАНТ_Оборудование_Солнечные
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗаписатьЗаказПокупателя = Ложь;
		
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_Тип) Тогда
			ДокОбъект.А_Тип = ДокОбъект.УдалитьАНТ_Тип;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ПлощадьДома) Тогда
			ДокОбъект.А_ПлощадьДома = ДокОбъект.УдалитьАНТ_ПлощадьДома;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_Мощность) Тогда
			ДокОбъект.А_Мощность = ДокОбъект.УдалитьАНТ_Мощность;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_Оборудование_Солнечные) Тогда
			ДокОбъект.А_Оборудование_Солнечные = ДокОбъект.УдалитьАНТ_Оборудование_Солнечные;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		
	//ТЧ.Запасы: УдалитьАНТ_ГруппаИД
	Для каждого сТЧ Из ДокОбъект.Запасы Цикл
		Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_ГруппаИД) Тогда
			сТЧ.А_ГруппаИД = сТЧ.УдалитьАНТ_ГруппаИД;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	//ТЧ.УдалитьАНТ_РазделыГруппы: РазделГруппа, РазделГруппаИД
	Для каждого сТЧ Из ДокОбъект.УдалитьАНТ_РазделыГруппы Цикл
		Если ЗначениеЗаполнено(сТЧ.РазделГруппа) Тогда
			сТЧДок = ДокОбъект.А_РазделыГруппы.Добавить();
			сТЧДок.РазделГруппа = сТЧ.РазделГруппа;
			сТЧДок.РазделГруппаИД = сТЧ.РазделГруппаИД;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗаписатьЗаказПокупателя = Истина Тогда
		Попытка
			ДокОбъект.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Записан документ " + ДокОбъект;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
КонецЦикла;	
		
	//СчетНаОплату
	//УдалитьАНТ_ЗаказПокупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплату.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ЗаказПокупателя) Тогда
			ДокОбъект.А_ЗаказПокупателя = ДокОбъект.УдалитьАНТ_ЗаказПокупателя;
			Попытка
				ДокОбъект.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ " + ДокОбъект + " со значением А_ЗаказПокупателя: " + ДокОбъект.А_ЗаказПокупателя;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//СчетНаОплатуПоставщика
	//УдалитьАНТ_ЗаказПоставщику
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщика.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ЗаказПоставщику) Тогда
			ДокОбъект.А_ЗаказПоставщику = ДокОбъект.УдалитьАНТ_ЗаказПоставщику;
			Попытка
				ДокОбъект.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ " + ДокОбъект + " со значением А_ЗаказПоставщику: " + ДокОбъект.А_ЗаказПоставщику;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	//СдельныйНаряд
	//УдалитьАНТ_ЗаказПокупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СдельныйНаряд.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СдельныйНаряд КАК СдельныйНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ЗаказПокупателя) Тогда
			ДокОбъект.А_ЗаказПокупателя = ДокОбъект.УдалитьАНТ_ЗаказПокупателя;
			Попытка
				ДокОбъект.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ " + ДокОбъект + " со значением А_ЗаказПокупателя: " + ДокОбъект.А_ЗаказПокупателя;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
