
&НаКлиенте
Процедура АНТ_ЗапасыАНТ_ВидЦеныПриИзмененииВместо(Элемент)
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	АНТ_РаботаСДокументамиКлиент.ПерезаполнитьЦенуСтрокиТабличнойЧастиПоВидуЦен(ЭтотОбъект, СтрокаТабличнойЧасти, Истина);
КонецПроцедуры

&НаКлиенте
Процедура АНТ_ЗапасыАНТ_КоэффициентПриИзмененииВместо(Элемент)
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.А_ЦенаПоТипу * СтрокаТабличнойЧасти.А_Коэффициент;
	РассчитатьСуммуВСтрокеТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура АНТ_ЗапасыНоменклатураПриИзмененииПосле(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.А_ВидЦены = Объект.ВидЦен;
	СтрокаТабличнойЧасти.А_ЦенаПоТипу = СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.А_Коэффициент = 1;
	
КонецПроцедуры

//{[+](фрагмент добавлен), Admin 11.09.2018 13:51:30
&НаСервере
Процедура АНТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Документы.РасходнаяНакладная.ПустаяСсылка() и НЕ ЗначениеЗаполнено(Параметры.Основание) Тогда
		 Объект.Организация = Справочники.Организации.ПустаяСсылка();
		 Объект.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		 Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли; 

КонецПроцедуры

//}Admin 11.09.2018 13:51:30
