
//{[+](фрагмент добавлен), Admin 11.09.2018 13:56:58
&НаСервере
Процедура АНТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Документы.ДополнительныеРасходы.ПустаяСсылка() и НЕ ЗначениеЗаполнено(Параметры.Основание) Тогда
		 Объект.Организация = Справочники.Организации.ПустаяСсылка();
		 Объект.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		 Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

//}Admin 11.09.2018 13:56:58