
//{[+](фрагмент добавлен), Admin 11.09.2018 13:48:44
&НаСервере
Процедура АНТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Документы.ЗаказПоставщику.ПустаяСсылка() и НЕ ЗначениеЗаполнено(Параметры.Основание) Тогда
		 Объект.Организация = Справочники.Организации.ПустаяСсылка();
		 Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		 Объект.СостояниеЗаказа = Справочники.СостоянияЗаказовПоставщикам.ПустаяСсылка(); 
	КонецЕсли; 

КонецПроцедуры

//}Admin 11.09.2018 13:48:44